Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: འདི་རྣམས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བ་ཡིན་ཏེ།
en: These people went forth in the teachings of the Perfectly Awakened One Kāśyapa.

source: འདི་རྣམས་ཀྱིས་དེ་ན་ལེ་ལོས་དུས་འདས་པར་བྱས་པས་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཞིང་པ་རྣམས་སུ་གྱུར་ཏོ།
en: They there spent their time lazily; that karma matured to cause them to become peasants.

source: །རྨོན་པ་འདི་རྣམས་ཀྱིས་ཀྱང་དེ་ཉིད་ལ་རབ་ཏུ་བྱུང་ནས་བསླབ་པའི་གཞི་ཕྲ་མོ་ཕྲ་མོ་རྣམས་ལ་གུས་པར་མ་བྱས་པས་ལས་དེའི་རྣམ་པར་སྨིན་པས་དུད་འགྲོ་རྣམས་སུ་སྐྱེས་སོ།
en: These oxen, too, went forth there, and they disregarded the minor rules of training; that karma matured to cause them to be reborn among animals.

source: །འདི་རྣམས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བ་གང་ཡིན་པ་དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ང་ལས་བདེན་པ་མཐོང་བར་བྱས་སོ།
en: Their karma of going forth in the teachings of the Perfectly Awakened One Kāśyapa matured to cause them to see the truths in my presence.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་ཞེས་བྱ་བ་རྒྱས་པར་སྦྱར་རོ།
en: Therefore, monks, the maturation of entirely negative actions is . . . . ”

source: །བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཨོ་ཏ་ལའི་བུས་དགེ་སྦྱོང་ཤཱཀྱའི་སྲས་ཤཱཀྱའི་རིགས་ལས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་བ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་དཔའ་སྡེ་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་ཨོ་ཏ་ལར་བྱོན་ནས། ཨོ་ཏ་ལ་ན་ཨོ་ཏ་ལའི་ནགས་ཁྲོད་ན་བཞུགས་ཏེ།
en: The very wealthy brahmin Otalāyana heard the following: “A śramaṇa, a son of the Śākyans from the Śākyan clan, one who went forth from his home into homelessness with true faith, having shaved off his hair and beard and donned saffron robes, was awakened to complete and supreme awakening, and he has arrived at Otalā, having traveled in Śūrasena, and is staying in Otalā Forest.

source: ཤེས་ལྡན་དག་དགེ་སྦྱོང་གཽ་ཏ་མ་དེའི་དགེ་བ་དང་། གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་རྒྱ་ཆེན་པོ་འདི་ལྟ་བུ་འདི་དག་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་གྲགས་པར་གྱུར་ཏེ།
en: Sirs, the great virtue, fame, renown, and praise of that śramaṇa Gautama are known in all directions.

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ།
en: Thus, that Blessed One is a tathāgata, an arhat, a perfectly awakened one, perfect in knowledge and conduct, a sugata, world knowing, a supreme tamer of people to be tamed, a teacher of gods and humans, a buddha, and a blessed one.

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་འཇིག་རྟེན་ལྷ་དང་བཅས་བདུད་དང་བཅས། ཚངས་པ་དང་བཅས་པ་སྐྱེ་དགུ་དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པ་རྣམས་ལ་རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ཏེ་རྫོགས་པར་བྱས་ནས་བདག་གི་ཟག་པ་ཟད་དོ།
en: Having in this life, by his own supernormal knowledge, actualized and accomplished awakening, he announced to the world with its gods, Māra, Brahmā, people such as śramaṇas and brahmins, and beings such as gods and humans, ‘My defilements have been exhausted.

source: །འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་གོ་བར་བྱེད་ཅིང་། དེས་ཆོས་བཤད་པ་ནི་ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ་མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ།
en: I will not know another existence after this one.’ He teaches only the Dharma that is good in the beginning, good in the middle, good at the end, excellent in meaning, excellent in wording, distinct, complete, pure, and immaculate.”

source: ཡོངས་སུ་དག་པ་རྣམ་པར་བྱང་བ་འབའ་ཞིག་སྟོན་ཏོ་ཞེས་ཐོས་ནས། དགེ་སྦྱོང་དང་བྲམ་ཟེ་དེ་ལྟ་བུ་ལྟ་བ་ནི་ལེགས་པ་ཡིན། ཉེ་བར་འགྲོ་བ་ནི་ལེགས་པ་ཡིན། བསྙེན་བཀུར་བྱེད་པ་ནི་ལེགས་པ་ཡིན་ནོ་སྙམ་དུ་བསམས་ནས་ཤིང་རྟ་རྟ་རྒོད་མ་དང་ལྡན་པ་ཐམས་ཅད་ནས་དཀར་བའི་ནང་དུ་ཞུགས་ཏེ་བྲམ་ཟེའི་ཁྱེའུའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་བྲམ་ཟེའི་ཁྱེའུའི་ཚོགས་ཀྱིས་མདུན་གྱིས་བལྟས་ནས་གསེར་གྱི་ཁར་བ་དང་རིལ་བ་སྤྱི་བླུགས་ཐོགས་ཏེ་ཨོ་ཏ་ལ་ནས་བྱུང་ནས། བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སོང་སྟེ།
en: Thinking that it would be good to see, approach, and serve such a śramaṇa or brahmin, he left Otalā, riding an entirely white chariot pulled by mares, surrounded and followed by young brahmins, carrying a golden water jar with a handle, and went to see and serve the Blessed One.

source: དེ་ཇི་ཙམ་བཞོན་པའི་སའི་བར་དུ་བཞོན་པས་སོང་ནས།
en: Having gone as far as he could go by vehicle, he alighted from the vehicle and entered the park on foot.

source: བཞོན་པ་ལས་བབས་ཏེ་རྐང་པ་ཁོ་ནས་ཀུན་དགའ་ར་བའི་ནང་དུ་ཞུགས་ནས་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཨོ་ཏ་ལའི་བུ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་ཡང་དག་པར་དགའ་བར་འགྱུར་བ་དང་། ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: The very wealthy brahmin Otalāyana went to the Blessed One, and when he arrived, he made plenty of pleasant and joyful conversation with the Blessed One, and then sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཨོ་ཏ་ལའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཀྱེ་གཽ་ཏ་མ་དབང་པོ་ལྔ་པོ་སྤྱོད་ཡུལ་ཐ་དད་པ་དང་ཡུལ་ཐ་དད་པ་ཅན་རང་རང་གི་སྤྱོད་ཡུལ་དང་ཡུལ་ཉམས་སུ་མྱོང་བར་འགྱུར་གྱི། གཞན་གྱིས་སྤྱོད་ཡུལ་དང་ཡུལ་གཞན་ཉམས་སུ་མྱོང་བར་མི་འགྱུར་བ་འདི་ལྟ་སྟེ།
en: Having sat down to one side, the very wealthy brahmin Otalāyana said to the Blessed One, “O Gautama, the five faculties have separate fields and separate domains, and each of them experiences its own field and domain but does not experience other fields and domains:

source: མིག་གི་དབང་པོ་དང་། རྣ་བའི་དབང་པོ་དང་། སྣའི་དབང་པོ་དང་། ལྕེའི་དབང་པོ་དང་། ལུས་ཀྱི་དབང་པོ་གང་དག་ལགས་པ་དེ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དང་ཡུལ་ཉམས་སུ་མྱོང་བར་བགྱིད་པ་ནི་གང་ལགས། དེ་རྣམས་ཀྱི་སྟོན་པ་ཡང་གང་ལགས།
en: namely, the faculty of the eyes, the faculty of the ears, the faculty of the nose, the faculty of the tongue, and the faculty of the body. What experiences the fields and domains of these? What is the basis of these?”

source: བྲམ་ཟེ་དབང་པོ་ལྔ་པོ་སྤྱོད་ཡུལ་ཐ་དད་པ་དང་། ཡུལ་ཐ་དད་པ་ཅན་འདི་ལྟ་སྟེ།
en: “O brahmin, the five faculties do have separate fields and separate domains:

source: མིག་གི་དབང་པོ་དང་། རྣ་བའི་དབང་པོ་དང་། སྣའི་དབང་པོ་དང་། ལྕེའི་དབང་པོ་དང་། ལུས་ཀྱི་དབང་པོ་གང་དག་ཡིན་པ་དེ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དང་ཡུལ་ཉམས་སུ་མྱོང་བ་ནི་ཡིད་ཡིན་ནོ།
en: namely, the faculty of the eyes, the faculty of the ears, the faculty of the nose, the faculty of the tongue, and the faculty of the body. It is mind that experiences the fields and domains of these.

source: །དེ་རྣམས་ཀྱི་རྟོན་པ་ཡང་ཡིད་ཡིན་ནོ།
en: The basis of these is mind.”

source: །ཀྱེ་གཽ་ཏ་མ་ཡིད་ཀྱི་རྟོན་པ་གང་ལགས།
en: “O Gautama, what is the basis of mind?”

source: བྲམ་ཟེ་ཡིད་ཀྱི་རྟོན་པ་ནི་དྲན་པ་ཡིན་ནོ།
en: “O brahmin, the basis of mind is mindfulness.”

source: །ཀྱེ་གཽ་ཏ་མ་དྲན་པའི་རྟོན་པ་གང་ལགས།
en: “O Gautama, what is the basis of mindfulness?”

source: བྲམ་ཟེ་དྲན་པའི་རྟོན་པ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡིན་ནོ།
en: “O brahmin, the basis of mindfulness is the four applications of mindfulness.”

source: །ཀྱེ་གཽ་ཏ་མ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞིའི་རྟོན་པ་གང་ལགས།
en: “O Gautama, what is the basis of the four applications of mindfulness?”

source: བྲམ་ཟེ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞིའི་རྟོན་པ་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ཡིན་ནོ།
en: “O brahmin, the basis of the four applications of mindfulness is the seven limbs of awakening.”

source: །ཀྱེ་གཽ་ཏ་མ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གྱི་རྟོན་པ་གང་ལགས།
en: “O Gautama, what is the basis of the seven limbs of awakening?”

source: བྲམ་ཟེ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གྱི་རྟོན་པ་ནི་རིག་པ་དང་རྣམ་པར་གྲོལ་བ་ཡིན་ནོ།
en: “O brahmin, the basis of the seven limbs of awakening is knowledge and liberation.”

source: །ཀྱེ་གཽ་ཏ་མ་རིག་པ་དང་རྣམ་པར་གྲོལ་བའི་རྟོན་པ་གང་ལགས།
en: “O Gautama, what is the basis of knowledge and liberation?”

source: བྲམ་ཟེ་རིག་པ་དང་རྣམ་པར་གྲོལ་བའི་རྟོན་པ་ནི་མྱ་ངན་ལས་འདས་པ་ཡིན་ནོ།
en: “O brahmin, the basis of knowledge and liberation is nirvāṇa.”

source: །ཀྱེ་གཽ་ཏ་མ་མྱ་ངན་ལས་འདས་པའི་རྟོན་པ་གང་ལགས།
en: “O Gautama, what is the basis of nirvāṇa?”

source: བྲམ་ཟེ་ཧ་ཅང་ཐལ་ཆེས་སོ་ཧ་ཅང་ཐལ་ཆེས་སོ་དྲི་བ་རྣམས་ཀྱི་མཐའ་གཟུང་བར་མི་ནུས་ཏེ།
en: “O brahmin, this is great nonsense, this is great nonsense. The end of such questions will never be reached.

source: ངའི་དྲུང་དུ་ནི་ཡང་དག་པར་སྡུག་བསྔལ་ཟད་པར་བྱ་བ་དང་། སྡུག་བསྔལ་གྱི་མཐར་བྱ་བའི་ཕྱིར་ཚངས་པར་སྤྱོད་པ་མྱ་ངན་ལས་འདས་པར་ཉེ་བར་འགྲོ་བ་དང་། མྱ་ངན་ལས་འདས་པའི་མཐར་ཐུག་པ་ཅན་སྤྱོད་པར་བྱེད་དོ།
en: In my presence, for the purpose of destroying suffering and bringing suffering to an end, the pure life is led, which approaches nirvāṇa and has nirvāṇa as its end.”

source: །དེ་ནས་བྲམ་ཟེ་ཨོ་ཏ་ལའི་བུ་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ལ་གནོད་པ་ཅི་ཞིག་བྱ་སྙམ་མོ། །དེས་ཀྱང་སྔོན་དགེ་སྦྱོང་གཽ་ཏ་མ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་གདུགས་ཚོད་གསོལ་ནས་སྨོན་ལམ་བཏབ་ན་དེས་ཅི་བསམ་པ་དང་ཅི་གསོལ་པ་དེ་ཐམས་ཅད་སོ་སོར་འཐོབ་པར་འགྱུར་རོ་ཞེས་ཐོས་སོ།
en: Then the brahmin Otalāyana thought, “What harm should I do to him?” He had heard before that if one invites the śramaṇa Gautama with the community of disciples, offers them a meal, and forms an aspiration, he will attain all that he wants and seeks.

source: །དེ་ནས་བྲམ་ཟེ་ཨོ་ཏ་ལའི་བུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ་ཞེས་བྱ་བ་ནས། གསོལ་ཟིན་ནས་ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས་སྨོན་ལམ་ལོག་པ་གདབ་པར་བརྩམས་པ་བདག་གིས་ཤཱཀྱའི་སྲས་ཀྱི་དགེ་སྦྱོང་ཇི་སྙེད་ཅིག་བཤོས་གསོལ་བ་འདི་ཐམས་ཅད་བདག་གི་གླང་དུ་གྱུར་ཅིག་སྙམ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐུགས་ཀྱིས་བྲམ་ཟེ་ཨོ་ཏ་ལའི་བུའི་བསམ་པ་མཁྱེན་ནས་བྲམ་ཟེ་ཨོ་ཏ་ལའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then the brahmin Otalāyana rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.” . . . Knowing the Blessed One had . . . washed his hands and his bowl, he took a low seat, sat before the Blessed One, and made this aspiration: “May all these śramaṇas, sons of the Śākyans, whom I have offered a meal, become my oxen.”

source: །བྲམ་ཟེ་ཁྱོད་ཀྱིས་མི་རུང་བའི་སེམས་བསྐྱེད་པ་དེ་ནི་འགྲུབ་པར་མི་འགྱུར་ཏེ།
en: The Blessed One, knowing the brahmin Otalāyana’s mind with his own mind, said to the brahmin Otalāyana, “O brahmin, you have conceived an undesirable thought; it will not be accomplished.

source: འདི་ལྟར་དགེ་སློང་འདི་ཐམས་ཅད་ནི་ཡང་སྲིད་པ་ཟད་པ་ཡིན་གྱིས། སེམས་གཞན་སྐྱེད་ཅིག་ཅེས་བཀའ་སྩལ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཡོན་བསྔོ་བ་མཛད་དེ་གཤེགས་སོ།
en: Since all these monks have destroyed their future existences, you should conceive another thought.” Having assigned the rewards of the offerings, the Blessed One departed.

source: །བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་བྲམ་ཟེ་ཨོ་ཏ་ལའི་བུས་སྨོན་ལམ་ལོག་པས་བསླང་བའི་སེམས་སྡིག་པ་ཅན་བསྐྱེད་ཀྱིས།
en: Having sat down, the Blessed One said to the monks, “Monks, since the brahmin Otalāyana conceived an evil thought and made an inappropriate aspiration, you should recite ‘Verses of the Ṛṣi’ after having had a meal;

source: ཁྱོད་ཅག་གིས་ཟན་ཟོས་ནས་གཙུག་ལག་ཁང་གི་ཚིགས་སུ་བཅད་པ་བརྗོད་ཅིག་དང་ལོག་པའི་སྨོན་ལམ་འགྲུབ་པར་མི་འགྱུར་རོ།
en: then such an inappropriate aspiration will not be accomplished.” B.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་ནས་ཕྱི་བཞིན་འབྲང་བའི་དགེ་སྦྱོང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་ཡུལ་ཨོ་ཏ་ལར་བསོད་སྙོམས་ལ་ཞུགས་པ་དང་། ཨོ་ཏ་ལ་ན་བྲན་མོ་རྒན་མོ་ཀ་ཙང་ག་ལ་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ།
en: Kacaṅgalā Thereupon the Blessed One, after the night had passed, entered Otalā for alms with the venerable Ānanda, the attending śramaṇa. There lived an old female slave named Kacaṅgalā in Otalā.

source: དེ་བུམ་པ་ཐོགས་ནས་ཆུ་ཆུར་ཁྲོན་པའི་དྲུང་དུ་སོང་བ་དང་བཅོམ་ལྡན་འདས་ཀྱང་ཕྱོགས་དེར་གཤེགས་ཏེ།
en: When she went to the well, taking a pitcher with her, the Blessed One went to that place, too.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་གདུལ་བའི་དུས་མཁྱེན་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One, knowing it was the time to convert her, said to the venerable Ānanda, “Ānanda, go and say to that old woman, ‘The Blessed One is thirsty; please give me some water.’ ”

source: ཀུན་དགའ་བོ་སོང་ལ་རྒན་མོ་ཕ་བི་ལ་བཅོམ་ལྡན་འདས་སྐྱེམས་ཀྱིས་ཆུ་ཕུལ་ཅིག་ཅེས་སྒོ་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས། རྒན་མོ་ཀ་ཙང་ག་ལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་རྒན་མོ་ཀ་ཙང་ག་ལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Certainly, O Honored One,” replied the venerable Ānanda to the Blessed One, and he went to Kacaṅgalā, the old woman.

source: །ཀ་ཙང་ག་ལ་བཅོམ་ལྡན་འདས་སྐྱེམས་ཀྱིས་ཆུ་ཕུལ་ཅིག་དེས་སྨྲས་པ་འཕགས་པ་བདག་ཉིད་འཚལ་ཏེ་མཆིའོ།
en: When he reached her, he said, “Kacaṅgalā, the Blessed One is thirsty; please give me some water.” “O noble one, I will bring it to him myself,” she replied.

source: །དེ་ནས་ཀ་ཙང་ག་ལས་ཆུས་བུམ་པ་བཀང་ནས་རིངས་པ་རིངས་པར་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་བ་དང་། ཀ་ཙང་ག་ལས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ།
en: Then Kacaṅgalā filled the pitcher with water and hurried to the Blessed One.

source: དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུས་མཛེས་པར་བྱས་པ། འོད་འདོམ་གང་གིས་བརྒྱན་པ། འོད་ཟེར་ཉི་མ་སྟོང་བས་ལྷག་པ། རིན་པོ་ཆེའི་རི་བོ་འགྲོ་བ་ལྟར་ཀུན་ནས་བཟང་བ་མཐོང་ངོ་།
en: As soon as Kacaṅgalā saw the Blessed One, who was fully ornamented with the thirty-two marks of a great man, illuminated by the eighty minor marks, ornamented with a fathom-wide halo, and beautiful like a moving mountain of jewels with light surpassing a thousand suns, she conceived the love one has for a son.

source: །མཐོང་མ་ཐག་ཏུ་ཡང་དེ་ལ་བུའི་སྡུག་པ་སྐྱེས་ནས་དེས་ལག་པ་བསྒྲེང་སྟེ་བུ་བུ་ཞེས་བཅོམ་ལྡན་འདས་ལ་འཁྱུད་པར་བརྩམས་པ་དང་། དགེ་སློང་རྣམས་ཀྱིས་དེ་བཟློག་གོ།
en: Raising her hands, she tried to embrace the Blessed One and cried, “Son! Son!” The monks prevented her.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཀྱིས་རྒན་མོ་འདི་མ་ཟློག་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The Blessed One told them, “Monks, you should not hinder this old woman. Why?

source: འདི་ནི་ཚེ་རབས་ལྔ་བརྒྱར་ཡང་།
en: “Since for five hundred lives she has always

source: །རྟག་ཏུ་ང་ཡི་ཡུམ་གྱུར་པས།
en: Been my mother, If you prevent her

source: །ང་ཡི་སྐུ་ལ་རེག་པ་ལས། །གལ་ཏེ་འདི་ནི་བཟློག་བྱས་ན།
en: From touching my body,

source: །དེའུ་རེ་མོད་ལ་ཁྲག་དྲོན་དག །འདི་ཡི་ཁ་ནས་སྐྱུག་པར་འགྱུར།
en: Immediately she will vomit Hot blood from her mouth.

source: །བུ་ལ་གདུང་བ་འདི་མཐོང་ནས།
en: “Seeing her missing her son,

source: །བྱས་པ་གཟོ་བ་རྗེས་དགོངས་ཏེ།
en: I reflect on gratitude

source: །ཐུགས་རྗེ་དང་ནི་ཐུགས་བརྩེ་བས།
en: And, out of compassion and love,

source: །སྐུ་ལ་རེག་ཏུ་གནང་བར་བྱ།
en: Allow her to touch my body.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་མགུར་ནས་འཁྱུད་དུ་གནང་བས་དེ་བུ་ལ་ཆགས་པ་དང་བྲལ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཆོས་མཉན་པའི་ཕྱིར་འདུག་གོ།
en: Because the Blessed One allowed her to embrace him around the neck, her attachment to her son calmed down, and she sat before the Blessed One to hear the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་བ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་འཕགས་པའི་བདེན་པ་བཞི་སོ་སོར་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One knew her thinking, proclivity, disposition, and nature and preached the Dharma that was appropriate for her and that caused her to penetrate the four truths of the noble ones.

source: དེ་ཐོས་ནས་ཀ་ཙང་ག་ལས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When she had heard the Dharma, Kacaṅgalā leveled the twenty high peaks of the mountain chain of the false view of individuality with the vajra of knowledge, and actualized the fruit of stream-entry.

source: དེས་བདེན་པ་མཐོང་ནས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པས་ཆེད་དུ་བརྗོད་པ།
en: After having seen the four truths of the noble ones, she spoke an inspired utterance three times:

source: བཙུན་པ་འདི་ལྟ་བུ་ནི་བདག་ལ་ཕས་མ་བགྱིས་ཏེ་མས་མ་ལགས་ཞེས་བྱ་བ་ནས་ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བགྱིས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །ཚིགས་སུ་བཅད་པ་དག་གིས་ཀྱང་གསོལ་པ། མ་ལ་ལན་དུ་ཕན་འདོགས་པའི།
en: “O Honored One, what the Blessed One has done for me is what has never been done for me by my father, my mother, . . . . With the vajra of knowledge I have leveled the twenty high peaks of the mountain chain of the false view of individuality that have been accumulated since beginningless time, and actualized the fruit of stream-entry.” And then she spoke these verses:

source: །བུ་མཆོག་གིས་ནི་བགྱི་བ་གང་།
en: “What should be done by the best son Who benefits his mother in return,

source: །ཐར་ལ་སེམས་གཞོལ་འགྱུར་བ་དེ།
en: Having the wish for her liberation,

source: །ཁྱོད་ཀྱིས་དེ་རིང་བདག་ལ་མཛོད།
en: This you have done for me today.

source: །ཁྱོད་ཀྱིས་བདག་ནི་ངན་འགྲོ་ལས།
en: “You have saved me from inferior modes of existence

source: །དྲངས་ཏེ་མཐོ་རིས་ཐར་ལ་བཞག །ཁྱོད་ནི་བརྩལ་བ་ཆེན་པོ་ཡིས།
en: And placed me in heaven and liberation; With great effort, you have done

source: །དཀའ་བ་ལེགས་པར་མཛད་པ་ལགས།
en: What is difficult to do.”

source: །ཞེས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Having spoken thus, she bowed low until her forehead touched the Blessed One’s feet, and then departed from the Blessed One’s presence.

source: །དེ་ནས་དུས་གཞན་ཞིག་ན་ཀ་ཙང་ག་ལས་ཇོ་བོ་ལ་གསོལ་བ་བཏབ་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Later, Kacaṅgalā went to the Blessed One, having gained permission from her master. When she arrived, she bowed low until her forehead touched the Blessed One’s feet, and then she sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན།
en: Having sat down to one side, she said to the Blessed One, “O Honored One, I wish to go forth and be ordained a nun in the well-taught Dharma and Vinaya.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་ལ་གཏད་དོ།
en: The Blessed One entrusted her to Mahāprajāpatī.

source: །དེ་ནས་དེས་རབ་ཏུ་ཕྱུང་བསྙེན་པར་རྫོགས་པར་བྱས་ཏེ་གདམས་ངག་བྱིན་ནོ།
en: Thereupon Mahāprajāpatī let her go forth, ordained her, and instructed her.

source: །དེས་བརྩོན་འགྲུས་དང་འབད་པ་དང་། བརྩལ་བ་བྱས་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས་དགྲ་བཅོམ་མར་གྱུར་ཏེ།
en: Exerting herself, endeavoring, and striving, she abandoned all the defilements, actualized the state of an arhantī, and became an arhantī.

source: ཁམས་གསུམ་གྱི་འདོད་ཆགས་དང་བྲལ་བ་ཞེས་བྱ་བ་ནས་རྗེད་པར་བྱ་བར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།། །།འདུལ་བ་གཞི། བམ་པོ་སུམ་བཅུ་རྩ་བདུན་པ།
en: She was free from desire for the three realms . . . became an object of . . . praise.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་མ་རྣམས་ལ་བསྡུས་ཏེ་མདོར་བཀའ་སྩལ་ནས། གཙུག་ལག་ཁང་དུ་ནང་དུ་ཡང་དག་འཇོག་པའི་ཕྱིར་འཇུག་པར་མཛད་པ་དེའི་ཚེ་ཀ་ཙང་ག་ལས་དེ་རྒྱས་པར་ལུང་སྟོན་ཏོ།
en: When the Blessed One had briefly preached to the nuns a sermon and entered the monastery to go into seclusion, Kacaṅgalā fully expanded on the teaching.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ངའི་ཉན་ཐོས་དགེ་སློང་མ་མདོ་སྡེ་རྣམ་པར་འབྱེད་པར་བྱེད་པ་རྣམས་ཀྱི་ནང་ན་འདི་ལྟ་སྟེ། དགེ་སློང་མ་ཀ་ཙང་ག་ལ་འདི་མཆོག་ཡིན་ནོ།
en: After that, the Blessed One said to the monks, “Monks, among my nuns, female disciples who analyze the sūtras, this nun Kacaṅgalā is the best.”

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཀ་ཙང་ག་ལས་ལས་ཅི་ཞིག་བགྱིས་ན་དེས་ན་རྒས་ནས་རབ་ཏུ་བྱུང་བར་གྱུར།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did Kacaṅgalā create that matured to cause her to go forth after she became old?

source: ལས་ཅི་ཞིག་བགྱིས་ན་དེས་ན་དབུལ་བ་དང་བྲན་མོར་གྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་སྲིད་པ་ཐ་མ་དེའི་མངལ་དུ་མ་བཟུང་བར་གྱུར། རབ་ཏུ་བྱུང་ནས་ཀྱང་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བགྱིས་ཤིང་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་མདོ་སྡེ་རྣམ་པར་འབྱེད་པར་བགྱིད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ལགས།
en: What karma did she create that matured to cause her to be a poor female slave, cause the Blessed One not to enter into her womb for his last birth, and cause her to realize the state of an arhantī after going forth, and to be praised by the Blessed One as the best of those who analyze the sūtras?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དགེ་སློང་མ་ཀ་ཙང་ག་ལ་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་ཚོགས་རྙེད་པ་དག་ཅེས་བྱ་བ་ནས།
en: “Monks,” the Blessed One replied, “the actions were performed and accumulated by the nun Kacaṅgalā herself, accruing a heap of karma. . . . . “. . .

source: །ལུས་ཅན་དག་ལ་འབྲས་བུར་འགྱུར་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: . . . bear fruit in embodied beings.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་ང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་ན་འདི་ངའི་ཡུམ་དུ་གྱུར་ཏེ།
en: “Monks, when I once was engaged in the conduct of a bodhisattva, she was my mother.

source: གང་གི་ཚེ་ང་རབ་ཏུ་འབྱུང་བར་འདོད་པ་དེའི་ཚེ་འདིས་ང་བཟློག་པས་ལས་དེའི་རྣམ་པར་སྨིན་པས་རྒས་ནས་རབ་ཏུ་བྱུང་ངོ་།
en: She stopped me when I wished to go forth; that karma matured to cause her to go forth after she became old.

source: །ང་སྦྱིན་པ་གཏོང་བ་ན་འདིས་བར་ཆད་བྱས་པས་དེས་ན་དབུལ་བར་གྱུར་ཏོ།
en: When I gave a donation, she interfered; because of this, she became poor.

source: །ཇི་ལྟར་སྒྱུ་འཕྲུལ་ཆེན་མོ་ལྟར་འདིས་བསོད་ནམས་དང་དབང་ཆེ་བར་གྲགས་པར་འགྱུར་བའི་ལས་མ་བྱས་ཏེ།
en: She did not perform great actions that would generate the great power of merit as Mahāmāyā did;

source: དེས་ན་ངའི་སྲིད་པ་ཐ་མ་འདིས་མངལ་དུ་མ་བཟུང་ངོ་།
en: therefore, I did not enter her womb for my last birth.

source: །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལས་རབ་ཏུ་བྱུང་ནས་དགེ་སློང་མ་སློབ་པ་དང་མི་སློབ་པ་རྣམས་ལ་བྲན་མོ་ཞེས་ཚིག་ཏུ་བརྗོད་པས་དེས་ན་བྲན་མོར་གྱུར་ཏོ།
en: Having gone forth in the presence of the Perfectly Awakened One Kāśyapa, she uttered the words ‘slave woman’ against nuns, both those who were practitioners undergoing training and those who were practitioners having completed training; therefore, she became a female slave.

source: །དེས་ན་འདིས་གང་དག་བཀླགས་ཤིང་བཏོན་པས་ཕུང་པོ་ལ་མཁས་པ་དང་། ཁམས་ལ་མཁས་པ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་པ་ལ་མཁས་པ་དང་། གནས་དང་གནས་མ་ཡིན་པ་ལ་མཁས་པར་བྱས་པས།
en: There, through recitation and repetition, she became familiar with the aggregates, spheres, and elements, dependent origination, and what is proper and what is improper;

source: དེས་ན་ངའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།
en: therefore, she abandoned all the defilements and actualized the state of an arhantī, having gone forth in my teaching.

source: །རབ་ཏུ་འབྱིན་པའི་མཁན་མོ་གང་ཡིན་པ་དེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་གིས་མདོ་སྡེ་རྣམ་པར་འབྱེད་པར་བྱེད་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དང་། དེས་ན་འདིས་ཀྱང་འཆི་བའི་དུས་ཀྱི་ཚེ་སྨོན་ལམ་བཏབ་པ། བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཡོན་གནས་བླ་ན་མེད་པ་ལ་ཚེ་ཇི་སྲིད་ཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་ལ་སྤྱད་ན་ཡོན་ཏན་གྱི་ཚོགས་འགའ་ཡང་མ་ཐོབ་ཀྱིས།
en: Since her preceptress who had ordained her had been praised by the Perfectly Awakened One Kāśyapa as the best of those who analyzed the sūtras, this woman made this aspiration at the time of her death: ‘While I have led the pure life throughout my life in the presence of the Blessed One, the Perfectly Awakened One Kāśyapa, the supreme one worthy of veneration, I have not yet attained any good qualities.
